{ 
  "news": [
    "[2024.07] Two paper were accepted by IROS 2024. Congratulations to Jiaxin, Zan, and Hanqing!",

    "[2024.05] One paper was accepted by ICML 2024. Congratulations to Manjie!",

    "[2024.02] One paper was accepted by CVPR 2024. Congratulations to Zan!",

    "[2024.01] One paper was accepted by IEEE VR 2024. Congratulations to Yuxin!",

    "[2023.07] Two papers were accepted by NeurIPS 2023. Congratulations to Manjie!",

    "[2023.07] One paper \"DREAMWALKER: Mental Planning for Continuous Vision-Language Navigation\" was accepted by ICCV 2023. Congratulations to Hanqing!",

    "[2023.04] One paper \"MEWL: Few-shot multimodal word learning with referential uncertainty\" was accepted by ICML 2023. Congratulations to Manjie!",

    "[2023.02] Two papers were accepted by CVPR 2023. Congratulations to Chuanqi, Hanqing, and Zan!",
    
    "[2023.01] Our paper \"Optimizing Product Placement for Virtual Stores\" is accepted by VR 2023. Congratulations to Luhui!",

    "[2022.09] Two papers were accepted by NeurIPS 2022. Congratulations to Zan and Hanqing!",
  
    "[2022.03] Our paper \"Counterfactual Cycle-Consistent Learning for Instruction Following and Generation in Vision-Language Navigation\" was accepted by CVPR 2022. Congratulations to Hanqing!",

    "[2021.03] Our paper \"Structured Scene Memory for Vision-Language Navigation\" was accepted by CVPR 2021. Congratulations to Hanqing!",

    "[2021.03] Two papers were accepted by ACM CHI 2021. Congratulations to Yujia!",

    "[2021.02] Two papers were accepted by IEEE VR 2021. Congratulations to Sifan and Jingjing!",

    "[2020.08] Our paper \"Scene Mover: Automatic Move Planning for Scene Arrangement by Deep Reinforcement Learning\" was accepted by SIGGRAPH Asia 2020. Congratulations to Hanqing!",

    "[2020.07] Two papers were accepted by ACM MM 2020. Congratulations to Yujia and Sifan!",

    "[2019.08] Our paper \"Comic-Guided Speech Synthesis\" was accepted by SIGGRAPH Asia 2019. Congratulations to Yujia!",

    "[2019.05] Our paper \"A Deep Coarse-to-Fine Network for Head Pose Estimation from Synthetic Data\" was accepted by Pattern Recognition. Congratulations to Yujia!",

    "[2019.02] Our paper \"Functional Workspace Optimization via Learning Personal Preferences from Virtual Experiences\" was reported by <a href=\"https://shiropen.com/seamless/functional-workspace-optimization-via-learning-personal-preferences-from-virtual-experiences\" style=\"vertical-align: middle;color:#4169E1\">Seamless</a>. Congratulations to Jingjing!",

    "[2019.02] Our paper \"Virtual Agent Positioning Driven by Scene Semantics in Mixed Reality\" was reported by <a href=\"https://shiropen.com/seamless-virtual-agent-positioning-driven\" style=\"vertical-align: middle;color:#4169E1\">Seamless</a>. Congratulations to Yining!",

    "[2019.02] Our paper was accepted by IEEE Virtual Reality 2019. Congratulations to Yining!",

    "[2018.11] Our paper was accepted by TVCG Special Issue on IEEE Virtual Reality and 3D User Interfaces (IEEE VR) 2019. Congratulations to Jingjing!",

    "[2018.11] Two papers were accepted by AAAI 2019. Congratulations to Hanqing and Yining!",

    "[2018.10] Yining received the 2018 national fellowship. Congratulations!",

    "[2018.01] Our paper \"Synthesizing Personalized Training Programs for Improving Driving Habits via Virtual Reality\" has been accepted by IEEE VR 2018.",

    "[2018.01] Our paper \"Spatially Perturbed Collision Sounds Attenuate Perceived Causality in 3D Launching Events\" has been accepted by IEEE VR 2018.",

    "[2017.11] Our paper \"Tracking Occluded Objects and Recovering Incomplete Trajectories by Reasoning about Containment Relations and Human Actions\" has been accepted to AAAI 2018.",

    "[2017.07] Our paper \"Transferring Object: Joint Inference of Container and Human Pose\" has been accepted to ICCV 2017."
  ],

  "publications": [
    {
      "image": "./project/iros24_tosa/teaser.png",
      "title": "Visual Loop Closure Detection with Thorough Temporal and Spatial Context Exploitation",
      "authors": "Jiaxin Li*, Zan Wang*, Huijun Di, Jian Li, Wei Liang",
      "publisher": "IROS 2024 (CCF C), <font style=\"color:#FF0800\">Oral Pitch</font>",
      "paper": "https://gauleejx.github.io/IROS2024_TOSA/static/pdfs/TOSA.pdf",
      "video": "https://www.youtube.com/watch?v=CmxsxJgDCXo",
      "presentation": "/",
      "project": "https://gauleejx.github.io/IROS2024_TOSA/",
      "description": "We propose to leverage the global temporal and local spatial-temporal information for loop closure detection."
    },
    {
      "image": "./project/iros24_plato/teaser.png",
      "title": "Mastering Scene Rearrangement with Expert-assisted Curriculum Learning and Adaptive Trade-Off Tree-Search",
      "authors": "Zan Wang*, Hanqing Wang*, Wei Liang",
      "publisher": "IROS 2024 (CCF C), <font style=\"color:#FF0800\">Oral Pitch</font>",
      "paper": "https://pl-ato.github.io/static/pdfs/paper.pdf",
      "video": "https://www.youtube.com/watch?v=gUYR1Hk8eVI",
      "presentation": "/",
      "project": "https://pl-ato.github.io/",
      "description": "We solve scene rearrangement planning by introducing an expert-assisted curriculum learning paradigm and a tree-search-based planner enhanced by an adaptive trade-off strategy."
    },
    {
      "image": "./project/icml24_ppae/teaser.jpg",
      "title": "Prompt-guided Precise Audio Editing with Diffusion Models",
      "authors": "Manjie Xu, Chenxing Li, Dan Su, Wei Liang, Dong Yu",
      "publisher": "ICML 2024 (CCF A)",
      "paper": "https://openreview.net/pdf?id=kQ1dwuheR0",
      "video": "/",
      "presentation": "/",
      "project": "https://sites.google.com/view/icml24-ppae",
      "description": "We present a novel editing approach guided by textual prompt which serves as a general module for diffusion models and enables precise editing of multimodal generation content."
    },
    {
      "image": "./project/cvpr24_afford/teaser.gif",
      "title": "Move as You Say, Interact as You Can: Language-guided Human Motion Generation with Scene Affordance",
      "authors": "Zan Wang, Yixin Chen, Baoxiong Jia, Puhao Li, Jinlu Zhang, Jingze Zhang, Tengyu Liu, Yixin Zhu, Wei Liang, Siyuan Huang",
      "publisher": "CVPR 2024 (CCF A), <font style=\"color:#FF0800\">Highlight</font>",
      "paper": "https://arxiv.org/abs/2403.18036",
      "video": "https://www.youtube.com/watch?v=emT0FHDYY1U",
      "presentation": "/",
      "project": "https://afford-motion.github.io/",
      "description": "We introduce a novel two-stage framework that employs scene affordance as an intermediate representation, effectively linking 3D scene grounding and conditional motion generation."
    },
    {
      "image": "./project/vr24_eye/teaser.jpg",
      "title": "Context-Aware Head-and-Eye Motion Generation with Diffusion Model",
      "authors": "Yuxin Shen, Manjie Xu, Wei Liang",
      "publisher": "IEEE VR 2024 (CCF A)",
      "paper": "./project/vr24_eye/VR2024_Eye.pdf",
      "video": "https://www.youtube.com/watch?v=_Hf872Ce0v4",
      "presentation": "/",
      "project": "https://sites.google.com/view/context-aware-generation",
      "description": "We use a diffusion model to generate realistic head-and-eye motions, which are harmoniously aliged with simulated environments."
    },
    {
      "image": "./project/neurips23_conan/teaser.jpg",
      "title": "Active Reasoning in an Open-World Environment",
      "authors": "Manjie Xu, Guangyuan Jiang, Wei Liang, Chi Zhang, Yixin Zhu",
      "publisher": "NeurIPS 2023 (CCF A)",
      "paper": "https://arxiv.org/pdf/2311.02018.pdf",
      "video": "https://vimeo.com/878540519",
      "presentation": "/",
      "project": "https://sites.google.com/view/conan-active-reasoning",
      "description": "We build artificial agents that possess the ability to actively explore, accumulate, and reason using both newfound and existing information to tackle incomplete-information questions, functioning like AI detectives."
    },
    {
      "image": "./project/neurips23_ivre/teaser.jpg",
      "title": "Interactive Visual Reasoning under Uncertainty",
      "authors": "Manjie Xu*, Guangyuan Jiang*, Wei Liang, Chi Zhang, Yixin Zhu",
      "publisher": "NeurIPS 2023 (CCF A)",
      "paper": "https://arxiv.org/pdf/2206.09203.pdf",
      "video": "https://vimeo.com/879078625",
      "presentation": "/",
      "project": "https://sites.google.com/view/ivre",
      "description": "We test modern artificial agents whether they can quickly resolve uncertainty by generating hypotheses and testing them via active trials when encountering a novel phenomenon accompanied by ambiguous cause-effect relations."
    },
    {
      "image": "./project/iccv23_dreamwalker/teaser.png",
      "title": "DREAMWALKER: Mental Planning for Continuous Vision-Language Navigation",
      "authors": "Hanqing Wang, Wei Liang, Luc Van Gool, Wenguan Wang",
      "publisher": "ICCV 2023 (CCF A)",
      "paper": "./project/iccv23_dreamwalker/dreamwalker.pdf",
      "video": "/",
      "presentation": "/",
      "project": "https://github.com/hanqingwangai/Dreamwalker",
      "description": "We propose DREAMWALKER — a world model-based VLN-CE agent that can plan strategically through large amounts of “mental experiments."
    },
    {
      "image": "./project/icml23_mewl/teaser.png",
      "title": "MEWL: Few-shot Multimodal Word Learning with Referential Uncertainty",
      "authors": "Guangyuan Jiang, Manjie Xu, Shiji Xin, Wei Liang, Yujia Peng, Chi Zhang, Yixin Zhu",
      "publisher": "ICML 2023 (CCF A)",
      "paper": "https://arxiv.org/abs/2306.00503",
      "video": "https://vimeo.com/843479503",
      "presentation": "/",
      "project": "https://sites.google.com/view/mewl",
      "description": "We introduce the MachinE Word Learning (MEWL) benchmark to assess how machines learn word meaning in grounded visual scenes."
    },
    {
      "image": "./project/cvpr23_dra/teaser.png",
      "title": "Discovering the Real Association: Multimodal Causal Reasoning in Video Question Answering",
      "authors": "Chuanqi Zang, Hanqing Wang, Mingtao Pei, Wei Liang",
      "publisher": "CVPR 2023 (CCF A)",
      "paper": "https://openaccess.thecvf.com/content/CVPR2023/papers/Zang_Discovering_the_Real_Association_Multimodal_Causal_Reasoning_in_Video_Question_CVPR_2023_paper.pdf",
      "video": "/",
      "presentation": "/",
      "project": "/",
      "description": "Video Question Answering (VideoQA) is challenging as it requires capturing accurate correlations between modalities from redundant information. We discover the real association by explicitly capturing visual features causally related to the question semantics and weakening the impact of local language semantics on question answering."
    },
    {
      "image": "./project/cvpr23_scenediffuser/teaser.png",
      "title": "Diffusion-based Generation, Optimization, and Planning in 3D Scenes",
      "authors": "Siyuan Huang*, Zan Wang*, Puhao Li, Baoxiong Jia, Tengyu Liu, Yixin Zhu, Wei Liang, Song-Chun Zhu",
      "publisher": "CVPR 2023 (CCF A)",
      "paper": "https://scenediffuser.github.io/paper.pdf",
      "video": "https://www.youtube.com/watch?v=a0SSprBoVV4",
      "presentation": "/",
      "project": "https://scenediffuser.github.io/",
      "description": "We introduce SceneDiffuser, a diffusion-based conditional generative model for 3D scene understanding. SceneDiffuser is applicable to various scene-conditioned 3D tasks."
    },
    {
      "image": "./project/vr23_store/teaser.png",
      "title": "Optimizing Product Placement for Virtual Stores",
      "authors": "Wei Liang, Luhui Wang, Xinzhe Yu, Changyang Li, Rawan Alghofaili, Yining Lang, Lap-Fai Yu",
      "publisher": "IEEE VR 2023 (CCF A)",
      "paper": "./project/vr23_store/Store_VR2023.pdf",
      "video": "/",
      "presentation": "/",
      "project": "/",
      "description": "We propose a novel approach for automatically optimizing product placement in virtual stores. This approach considers product exposure and spatial constraints and applies an optimizer to search for optimal placement solutions."
    },
    {
      "image": "./project/ijcv23_active/teaser.jpg",
      "title": "Active Perception for Visual-Language Navigation",
      "authors": "Hanqing Wang, Wenguan Wang, Wei Liang, Steven C. H. Hoi, Jianbing Shen, Luc Van Gool",
      "publisher": "IJCV 2023 (CCF A)",
      "paper": "https://link.springer.com/article/10.1007/s11263-022-01721-6",
      "video": "/",
      "presentation": "/",
      "project": "/",
      "description": "This work draws inspiration from human navigation behavior and endows an agent with an active perception ability for more intelligent navigation. To this end, we propose an end-to-end framework for learning an exploration policy that decides (i) when and where to explore, (ii) what information is worth gathering during exploration, and (iii) how to adjust the navigation decision after the exploration."
    },
    {
      "image": "./project/neurips22_mtn/teaser.png",
      "title": "Towards Versatile Embodied Navigation",
      "authors": "Hanqing Wang, Wei Liang, Luc Van Gool, and Wenguan Wang.", 
      "publisher": "NeurIPS 2022 (CCF A), <font style=\"color:#FF0800\">Spotlight</font>",
      "paper": "./project/neurips22_mtn/MTN.pdf",
      "video": "/",
      "presentation": "/",
      "project": "https://github.com/HanqingWangAI/VXN",
      "description": "We introduce VXN, a large multi-task embodied navigation dataset comprising image-goal navigation, object-goal navigation, audio-goal navigation, and vision-language navigation. To solve this challenging task, we introduce Vienna, a versatile navigation agent."
    },
    {
      "image": "./project/neurips22_humanise/teaser.png",
      "title": "HUMANISE: Language-conditioned Human Motion Generation in 3D Scenes",
      "authors": "Zan Wang, Yixin Chen, Tengyu Liu, Yixin Zhu, Wei Liang, and Siyuan Huang.", 
      "publisher": "NeurIPS 2022 (CCF A)",
      "paper": "https://arxiv.org/abs/2210.09729",
      "video": "https://www.youtube.com/watch?v=NIdqvN8ex4M",
      "presentation": "https://recorder-v3.slideslive.com/#/share?share=74179&s=0a18d15c-4ca4-424a-8aa7-a91a7ac3701c",
      "project": "https://silvester.wang/HUMANISE/",
      "description": "We propose a large-scale and semantic-rich human-scene interaction dataset, HUMANISE, which provides language description for each human-scene interaction. HUMANISE enables a new generation task: language-conditioned human motion generation in 3D scenes."
    },
    {
      "image": "./project/cvpr22_counterfactual/teaser.png",
      "title": "Counterfactual Cycle-Consistent Learning for Instruction Following and Generation in Vision-Language Navigation",
      "authors": "Hanqing Wang, Wei Liang, Jianbing Shen, Luc Van Gool, and Wenguan Wang.",
      "publisher": "CVPR 2022 (CCF A)",
      "paper": "https://openaccess.thecvf.com/content/CVPR2022/papers/Wang_Counterfactual_Cycle-Consistent_Learning_for_Instruction_Following_and_Generation_in_Vision-Language_CVPR_2022_paper.pdf",
      "video": "/",
      "presentation": "/",
      "project": "https://github.com/HanqingWangAI/CCC-VLN",
      "description": "We propose a unified learning framework that leverages cycle consistency and counterfactual thinking to jointly learn a navigation agent (follower), an instruction generation agent (speaker), and a counterfactual environment generation agent (creator)."
    },
    {
      "image": "https://i.loli.net/2021/06/27/cLnTK41wvZsXO5C.png",
      "title": "Structured Scene Memory for Vision-Language Navigation",
      "authors": "Hanqing Wang, Wenguan Wang, Wei Liang, and Jianbing Shen",
      "publisher": "CVPR 2021 (CCF A)",
      "paper": "https://hanqingwangai.github.io/assets/files/posts/ssm/ssm.pdf",
      "video": "/",
      "presentation": "/",
      "project": "https://github.com/HanqingWangAI/SSM-VLN",
      "description": "We propose a novel scene representation called Structured Scene Memory (SSM) for vision-language navigation tasks. It explicitly preserves navigation memory and provides global action space for navigation agents."
    },
    {
      "image": "https://i.loli.net/2021/02/07/VgnQBWTcsak15Et.jpg",
      "title": "Scene-Aware Behavior Synthesis for Virtual Pets in Mixed Reality",
      "authors": "Wei Liang, Xinzhe Yu, Rawan Alghofaili, Yining Lang, Lai-Fai Yu",
      "publisher": "ACM CHI 2021 (CCF A)",
      "paper": "http://liangwei-bit.github.io/web/project/chi21_pets/chi21_pets.pdf",
      "video": "https://youtu.be/VbAe-0_SNXg",
      "presentation": "/",
      "project": "http://liangwei-bit.github.io/web/project/chi21_pets",
      "description": "We propose a novel approach to synthesize virtual pet behaviors by considering scene semantics, enabling a virtual pet to behave naturally in mixed reality."
    },
    {
      "image": "https://i.loli.net/2021/02/07/wCsZoqf3A6IEuQR.jpg",
      "title": "Toward Automatic Audio Description Generation for Accessible Videos",
      "authors": "Yujia Wang, Wei Liang, Haikun Huang, Yongqi Zhang, Dingzeyu Li, and Lap-Fai Yu",
      "publisher": "ACM CHI 2021 (CCF A)",
      "paper": "https://bitwangyujia.github.io/research/paper/SIGCHI2021-ad.pdf",
      "video": "https://youtu.be/S45vFg476aM",
      "presentation": "/",
      "project": "http://liangwei-bit.github.io/web/project/chi21_description",
      "description": "We propose an audio description system that automatically generates audio descriptions for videos. Our user study shows that, with our audio descriptions, blind participants are more confident about what is happening in a video."
    },
    {
      "image": "https://i.loli.net/2021/02/08/OEkoLZwRvVse8tK.jpg",
      "title": "Climaxing VR Character with Scene-Aware Aesthetic Dress Synthesis",
      "authors": "Sifan Hou, Yujia Wang, Wei Liang, and Bing Ning",
      "publisher": "IEEE VR 2021 (CCF A)",
      "paper": "./project/vr21_dress/Dress_VR2021.pdf",
      "video": "/",
      "presentation": "/",
      "project": "/",
      "description": "We propose an approach to automatically synthesize aesthetic dresses for the virtual character within different scenes. The synthesized clothes are in harmony with scene semantics (e.g., season and occasion) and the character's appearance attributes (e.g., gender and age)."
    },
    {
      "image": "https://i.loli.net/2021/02/07/q7gu5zy3mwQsDkX.jpg",
      "title": "Work Surface Arrangement Optimization Driven by Human Activity",
      "authors": "JingJing Liu, Wei Liang, Bing Ning, and Ting Mao",
      "publisher": "IEEE VR 2021 (CCF A)",
      "paper": "./project/vr21_worksurface/Work_Surface_VR2021.pdf",
      "video": "/",
      "presentation": "/",
      "project": "/",
      "description": "We propose an approach to capture human habitual behaviors of interacting with objects on the work surface via a Hololens helmet. The habitual behaviors are subsequently applied to optimize the arrangement of the work surface, resulting in a personalized arrangement."
    },
    {
      "image": "https://i.loli.net/2021/02/07/hWCi6AT4IvmD3fd.gif",
      "title": "Scene Mover: Automatic Move Planning for Scene Arrangement by Deep Reinforcement Learning",
      "authors": "Hanqing Wang, Wei Liang, and Lap-Fai Yu",
      "publisher": "SIGGRAPH Asia 2020 (CCF A)",
      "paper": "https://dl.acm.org/doi/abs/10.1145/3414685.3417788",
      "video": "/",
      "presentation": "/",
      "project": "https://github.com/HanqingWangAI/SceneMover",
      "description": "We introduce a novel task, scene rearrangement, and an effective solution that leverages MCTS and deep reinforcement learning to tackle it."
    },
    {
      "image": "https://i.loli.net/2021/02/07/K8V6PvYqaQk9XIO.jpg",
      "title": "Scene-Aware Background Music Synthesis",
      "authors": "Yujia Wang, Wei Liang, Wanwan Li, Dingzeyu Li, and Lap-Fai Yu",
      "publisher": "ACM MM 2020 (CCF A), <font style=\"color:#FF0800\">Oral Presentation (9% acceptance rate) </font>",
      "paper": "http://liangwei-bit.github.io/web/project/mm20_music/MM-music.pdf",
      "video": "https://youtu.be/fG2u2QG8ejU",
      "presentation": "/",
      "project": "http://liangwei-bit.github.io/web/project/mm20_music",
      "description": "We introduce an interactive background music synthesis algorithm guided by visual content that can synthesize dynamic background music for different scenarios. We also conduct quantitative and qualitative analyses of the synthesized results to validate the approach's efficacy."
    },
    {
      "image": "./project/mm20_pose/mm20_pose.jpg",
      "title": "Photo Stand-Out: Photography with Virtual Character",
      "authors": "Yujia Wang, Sifan Hou, Bing Ning, and Wei Liang",
      "publisher": "ACM MM 2020 (CCF A), <font style=\"color:#FF0800\">Oral Presentation (9% acceptance rate) </font>",
      "paper": "./project/mm20_pose/Pose_MM2020.pdf",
      "video": "/",
      "presentation": "/",
      "project": "/",
      "description": "We propose a novel optimization framework to synthesize an aesthetic pose for the virtual character concerning the presented user's pose by optimizing a cost function that guides the rotation of each body joint angle."
    },
    {
      "image": "https://i.loli.net/2021/02/07/9nwZJucr5FblGQT.jpg",
      "title": "Active Visual Information Gathering for Vision-Language Navigation",
      "authors": "Hanqing Wang, Wenguan Wang, Tianmin Shu, Wei Liang, and Jianbing Shen",
      "publisher": "ECCV 2020 (CCF B)",
      "paper": "https://arxiv.org/abs/2007.08037",
      "video": "/",
      "presentation": "/",
      "project": "https://github.com/HanqingWangAI/Active_VLN",
      "description": "We propose an end-to-end trainable agent with active exploration ability for the VLN task. The agent can intelligently interact with the environment and actively gather information when faced with ambiguous instructions or unconfident navigation decisions."
    },
    {
      "image": "https://i.loli.net/2020/09/26/RMbt4PJFCVfDErQ.png",
      "title": "Comic-Guided Speech Synthesis",
      "authors": "Yujia Wang, Wenguan Wang, Wei Liang and Lap-Fai Yu",
      "publisher": "SIGGRAPH Asia 2019 (CCF A)",
      "paper": "https://bitwangyujia.github.io/research/paper/siga19-comic.pdf",
      "video": "https://www.youtube.com/watch?v=2cOgWoejbr8&feature=youtu.be",
      "presentation": "https://bitwangyujia.github.io/research/project/Speech_Results/Speech_Results.html",
      "project": "https://bitwangyujia.github.io/research/project/comic2speech.html",
      "description": "We propose an approach to automatically narrate the input comic page by synthesizing realistic speeches for each character. The synthesized speeches carry the identity properties (gender and age) and emotion conditions (e.g., happy, sad, and angry) of the characters inferred from the comic input."
    },
    {
      "image": "https://i.loli.net/2020/09/26/Baqm1CbKFkfoT53.gif",
      "title": "A Deep Coarse-to-Fine Network for Head Pose Estimation from Synthetic Data",
      "authors": "Yujia Wang, Wei Liang, Jianbing Shen, Yunde Jia, and Lap-Fai Yu",
      "publisher": "Pattern Recognition 2019",
      "paper": "http://liangwei-bit.github.io/web/project/headpose/PR-headpose-2019.pdf",
      "video": "https://youtu.be/30nTWHXURjQ",
      "presentation": "http://liangwei-bit.github.io/web/project/headpose/PR-headpose-2019.pdf",
      "project": "http://liangwei-bit.github.io/web/project/headpose",
      "description": "We propose a deep neural network to estimate head poses using the Coarse-to-Fine strategy. To tackle the problem of insufficient annotated data for training, we design a rendering pipeline to synthesize realistic head images and generate an annotated dataset containing 310k head poses."
    },
    {
      "image": "https://i.loli.net/2020/09/26/8mMNcpvxXsb9g6j.gif",
      "title": "Virtual Agent Positioning Driven by Scene Semantics in Mixed Reality",
      "authors": "Yining Lang, Wei Liang, and Lap-Fai Yu",
      "publisher": "IEEE VR 2019 (CCF A)",
      "paper": "http://liangwei-bit.github.io/web/project/agent/AR-v22.pdf",
      "video": "http://liangwei-bit.github.io/web/project/agent/video.mp4",
      "presentation": "http://liangwei-bit.github.io/web/project/agent/AR-v22.pdf",
      "project": "http://liangwei-bit.github.io/web/project/agent",
      "description": "We propose a novel approach using scene semantics to guide the positioning of a virtual agent. This approach comprises a visibility term and a spatial term and achieves a higher user evaluation score than the alternative approaches."
    },
    {
      "image": "https://i.loli.net/2020/09/26/nbygOF6vptMuPiY.gif",
      "title": "Functional Workspace Optimization via Learning Personal Preferences from Virtual Experiences",
      "authors": "Wei Liang, Jingjing Liu, Yining Lang, Bing Ning and Lap-Fai Yu",
      "publisher": "IEEE TVCG 2019 (CCF A)",
      "paper": "http://liangwei-bit.github.io/web/project/kitchen/tvcg19kitchen.pdf",
      "video": "https://youtu.be/2Eg3_0vHU2U",
      "presentation": "http://liangwei-bit.github.io/web/project/kitchen/tvcg19kitchen.pdf",
      "project": "http://liangwei-bit.github.io/web/project/kitchen",
      "description": "We propose an approach to learn the personal preferences of using a functional workspace by analyzing a user performing given tasks via VR devices, e.g., making a salad in the kitchen. The learned preferences are applied to optimizing the workspace, which results in an updated layout that fits the user's preferences better."
    },
    {
      "image": "https://i.loli.net/2020/09/26/SC1dtHu6JKarlxR.gif",
      "title": "Deep Single-View 3D Object Reconstruction with Visual Hull Embedding",
      "authors": "Hanqing Wang, Jiaolong Yang, Wei Liang and Xin Tong",
      "publisher": "AAAI 2019 (CCF A), <font style=\"color:#FF0800\">Oral Presentation </font>",
      "paper": "https://arxiv.org/pdf/1809.03451.pdf",
      "video": "https://youtu.be/nBjzM7PasGk",
      "presentation": "http://liangwei-bit.github.io/web/project/aaai19_3d_recon/presentation.pdf",
      "project": "http://liangwei-bit.github.io/web/project/aaai19_3d_recon",
      "description": "We propose a 3D reconstruction approach that preserves more shape details and improves the reconstruction quality. Our key idea is to leverage object mask and pose estimation from CNNs to assist 3D shape learning by constructing a probabilistic single-view visual hull inside the network."
    },
    {
      "image": "https://i.loli.net/2020/09/26/lQUSbprea718hmZ.gif",
      "title": "3D Face Synthesis Driven by Personality Impression",
      "authors": "Yining Lang, Wei Liang, Yujia Wang, and Lap-Fai Yu",
      "publisher": "AAAI 2019 (CCF A)",
      "paper": "http://liangwei-bit.github.io/web/project/face/aaai19-face_v8.pdf",
      "video": "https://youtu.be/B8b8iQOu45c",
      "presentation": "http://liangwei-bit.github.io/web/project/face/aaai19-face_v8.pdf",
      "project": "http://liangwei-bit.github.io/web/project/face",
      "description": "We propose a novel approach to synthesize 3D faces based on personality impressions for creating virtual characters. We demonstrate that our approach can automatically synthesize a variety of 3D faces to give different personality impressions."
    },
    {
      "image": "https://i.loli.net/2020/09/26/KqYvHmXf8adlDwV.gif",
      "title": "Tracking Occluded Objects and Recovering Incomplete Trajectories by Reasoning about Containment Relations and Human Actions",
      "authors": "Wei Liang, Yixin Zhu, and Song-Chun Zhu",
      "publisher": "AAAI 2018 (CCF A)",
      "paper": "http://liangwei-bit.github.io/web/project/aaai_tracking/AAAI_2018_Tracking_by Reasoning.pdf",
      "video": "https://youtu.be/Uc8pKLo319I",
      "presentation": "/",
      "project": "http://liangwei-bit.github.io/web/project/aaai_tracking",
      "description": "We propose an algorithm to formulate the tracking problem as a network flow representation encoding containment relations and their changes and demonstrating better performance on tracking occluded objects than baseline methods."
    },
    {
      "image": "https://i.loli.net/2020/09/26/mC1lxOeP4zMDTqk.gif",
      "title": "Synthesizing Personalized Training Programs for Improving Driving Habits via Virtual Reality",
      "authors": "Yining Lang, Wei Liang, Fang Xu, Yibiao Zhao, and Lap-Fai Yu",
      "publisher": "IEEE VR 2018 (CCF A)",
      "paper": "http://liangwei-bit.github.io/web/project/Driving/IEEE-VR-DRIVING.pdf",
      "video": "https://youtu.be/KEIFE8ZfWgo",
      "presentation": "http://liangwei-bit.github.io/web/project/Driving/IEEE-VR-Driving.pdf",
      "project": "http://liangwei-bit.github.io/web/project/Driving",
      "description": "We propose an approach first to identify the improper driving habits of a user when he drives in a virtual city. Then, it synthesizes a pertinent training program to help improve the users driving skills based on the discovered improper habits of the user."
    },
    {
      "image": "https://i.loli.net/2020/09/26/6WqKGnrNezj7m3P.gif",
      "title": "Spatially Perturbed Collision Sounds Attenuate Perceived Causality in 3D Launching Events",
      "authors": "Duotun Wang, James Kubricht, Yixin Zhu, Wei Liang, Song-Chun Zhu, Chenfanfu Jiang, and Hongjing Lu",
      "publisher": "IEEE VR 2018 (CCF A)",
      "paper": "http://liangwei-bit.github.io/web/project/Wang/vr18b-sub1099-cam-i6.pdf",
      "video": "https://youtu.be/s0pPDoyPnCk",
      "presentation": "http://liangwei-bit.github.io/web/project/Wang/ieeevr2018_oral_final _for pdf.pdf",
      "project": "http://liangwei-bit.github.io/web/project/Wang",
      "description": "We discover that people can localize sound positions based on the auditory inputs in VR environments, and the spatial discrepancy between the estimated position of the collision sound and the visually observed impact location attenuates perceived causality."
    },
    {
      "image": "https://i.loli.net/2020/09/26/hszOl8Aw5u2Z7K6.gif",
      "title": "Transferring Object: Joint Inference of Container and Human Pose",
      "authors": "Hanqing Wang, Wei Liang, and Lap-Fai Yu",
      "publisher": "ICCV 2017 (CCF A)",
      "paper": "http://liangwei-bit.github.io/web/project/container/iccv2017container_files/iccv2017container.pdf",
      "video": "https://youtu.be/oCNCHbYmGgg",
      "presentation": "/",
      "project": "http://liangwei-bit.github.io/web/project/container",
      "description": "We propose an approach to jointly infer container and human pose for transferring objects by minimizing the costs associated with both object and pose candidates."
    },
    {
      "image": "https://i.loli.net/2020/09/26/KcHQkZiz56eMvmp.gif",
      "title": "Earthquake Safety Training through Virtual Drills",
      "authors": "Changyang Li, Wei Liang, Chris Quigley, Yibiao Zhao, and Lap-Fai Yu",
      "publisher": "IEEE TVCG 2017 (CCF A)",
      "paper": "http://liangwei-bit.github.io/web/project/earthquake/vr2017earthquake_files/vr2017earthquake.pdf",
      "video": "https://youtu.be/NdVcUAB0XAE",
      "presentation": "/",
      "project": "http://liangwei-bit.github.io/web/project/earthquake",
      "description": "We provide an immersive and novel virtual reality training approach designed to teach individuals how to survive earthquakes in indoor environments. Our approach utilizes virtual environments realistically populated with furniture objects for training."
    },
    {
      "image": "https://i.loli.net/2020/09/26/DesYv2wZ9iBqMTA.gif",
      "title": "What is Where: Inferring Containment Relations from Videos",
      "authors": "Wei Liang, Yibiao Zhao, Yixin Zhu, and Song-chun Zhu",
      "publisher": "IJCAI 2016 (CCF A), <font style=\"color:#FF0800\">Oral Presentation </font>",
      "paper": "http://liangwei-bit.github.io/web/project/ijcai16_container/ijcai16_container.pdf",
      "video": "https://youtu.be/VQlssiSGQHc",
      "presentation": "/",
      "project": "http://liangwei-bit.github.io/web/project/ijcai16_container",
      "description": "We present a probabilistic approach to explicitly infer containment relations between objects in 3D scenes. Given an input RGB-D video, our algorithm quantizes the perceptual space of a 3D scene by reasoning about containment relations over time."
    },
    {
      "image": "https://i.loli.net/2020/09/26/cZl9IMFHp2iLArs.gif",
      "title": "3D Head Pose Estimation with Convolutional Neural Network Trained on Synthetic Images",
      "authors": "Xiabing Liu, Wei Liang, Yumeng Wang, Shuyang Li, and Mingtao Pei",
      "publisher": "ICIP 2016",
      "paper": "http://liangwei-bit.github.io/web/project/icip16_headpose/icip16_headpose.pdf",
      "video": "/",
      "presentation": "/",
      "project": "http://liangwei-bit.github.io/web/project/icip16_headpose",
      "description": "We propose a method to estimate head pose using a convolutional neural network trained on synthetic head images. We formulate head pose estimation as a regression problem and evaluate our method on synthetic and real data."
    },
    {
      "image": "https://i.loli.net/2020/09/26/843unv9Cjz75m6N.gif",
      "title": "Evaluating Human Cognition of Containing Relations with Physical Simulation",
      "authors": "Wei Liang, Yibiao Zhao, Yixin Zhu, and Songchun Zhu",
      "publisher": "CogSci 2015 (CCF B)",
      "paper": "http://liangwei-bit.github.io/web/project/cogsci15_container/cogsci15_container.pdf",
      "video": "https://www.youtube.com/watch?v=kmO4MptwhhM",
      "presentation": "http://liangwei-bit.github.io/web/project/cogsci15_container/ppt.pdf",
      "project": "http://liangwei-bit.github.io/web/project/cogsci15_container",
      "description": "We discover that physical simulation is an excellent approximation of the human cognition of containers and the containing relations using physical simulation. We also analyze human judgments concerning physical simulation results under different scenarios."
    }
  ]
}